#ifndef __WRITER_H__
#define __WRITER_H__

#define FIRST_QUEUE_IS_FULL "Первая очередь переполнена.\n"
#define SECOND_QUEUE_IS_FULL "Вторая очередь переполнена.\n"

#define CURR_QUEUE_STATUS "--------------------------------------------------------------\n" \
                          "|  %5d        |   на данный момент  |      в среднем       |\n" \
                          "|------------------------------------------------------------|\n" \
                          "| 1-ая очередь  |       %5d         |        %5d         |\n" \
                          "|------------------------------------------------------------|\n" \
                          "| 2-ая очередь  |       %5d         |        %5d         |\n" \
                          "--------------------------------------------------------------\n" 



#define RES_ARRAY "\n\n==============================================================\n" \
                 "|                 Моделирование для массива                  |\n"

#define RES_LIST "\n\n==============================================================\n" \
                 "|           Моделирование для связного списка                |\n"

#define RESULTS "|------------------------------------------------------------|\n" \
                "|               |         Вход        |        Выход         |\n" \
                "|------------------------------------------------------------|\n" \
                "| 1-ая очередь  |      %-7d        |     %-7d          |\n" \
                "|------------------------------------------------------------|\n" \
                "| 2-ая очередь  |      %-7d        |     %-7d          |\n" \
                "--------------------------------------------------------------\n" \
                " - Время моделирования: %f тиков (%d мкс) \n\n" \
                " - Время простоя: %f \n\n" \
                " - Ожидаемое время моделирования: %lf \n\n" \
                " - Погрешность: %lf%% \n\n" \
                " - Средний размер: %ld байт \n" \
                "--------------------------------------------------------------\n" 


#endif
